# 아 모의고사 망했어
# 그래도 국어는 해야지



def score():
    print("이것은 2022년 9월 고1 모의고사-국어 채점 프로그램입니다. 답을 입력하면 맞을 경우 '정답입니다'가 틀렸을 경우에는 정답과 해설이 같이 출력됩니다. 마지막에는 총점이 출력됩니다.")
    print("혹시나 문제 해설에 오타가 있을 경우에는 'jdh04133@naver.com'으로 연락 부탁드립니다.")
    one = input("Please enter the correct answer to question 1: ")
    one = int(one)
    if one == 4:
        one_score = 2
        print("정답입니다!")
    else:
        one_score = 0
        print("1번: 4")
        print("발표에는 청중의 요청이 드러나 있지 않으며 청중의 요청에 따른 추가 정보가 제공되지 않는다. ① 1문단, 2문단, 4문단에 따르면, 발표자가 청중에게 질문을 하고 청중의 대답을 들은 뒤 발표를 이어 가고 있다. ② 5문단에 따르면, 한옥에 사용된 창의 종류를 언급하고 있다. ③ 2문단에 따르면, '눈꼽재기창'의 명칭을 설명하여 청중의 이해를 돕고 있다. ⑤ 2문단에 '화면을 손으로 가리키며'라는 비언어적 표현을 통해 청중이 발표 내용에 집중하게 하고 있다.")
    two = input("Please enter the correct answer to question 2: ")
    two = int(two)
    if two == 4:
        two_score = 2
        print("정답입니다!")
    else:
        two_score = 0
        print("2번: 4")
        print("발표에서는 꽃살창의 무늬가 상징하는 의미를 설명하고 있지 않다.")
        print("① [자료 1]은 눈꼽재기창의 작은 크기와 출입문 옆이라는 위치를 보여 주는 자료이므로 ㉠에 사용할 수 있다. ② [자료 2]는 벼락받이창을 고정하기 위해 사용되는 도구를 보여 주는 자료이므로 벼락닫이창을 고정하는 방법을 설명하기 위해 ㉡에 사용할 수 있다. ⑤ [자료 3]은 꽃살창에 새겨진 꽃무늬를 보여 주는 자료이므로 ㉢에 사용할 수 있다.")
    three = input("Please enter the correct answer to question 3: ")
    three = int(three)
    if three == 5:
        three_score = 2
        print("정답입니다!")
    else:
        three_score = 0
        print("3번: 5")
        print("'학생 2'는 한옥의 여닫이창과 벽의 이음새에 달린 쇠붙이를 보았던 경험을 떠올렸고, '학생 3'은 고궁에서 꽃살창을 보았던 경험을 떠올렸으므로 적절하다.")
        print("② '학생 2'는 발표 과정에서 궁금증이 생겼으나 이를 해소할 방안을 생각하고 있지 않으므로 적절하지 않다. ④ '학생 1'은 '학생 2'와 달리 발표에서 직접 언급하지 않은 내용을 추론하며 듣고 있다.")
    four = input("Please enter the correct answer to question 4: ")
    four = int(four)
    if four == 2:
        four_score = 2
        print("정답입니다!")
    else:
        four_score = 0
        print("4번: 2")
        print("㈎에는 자료의 출처를 밝힌 부분이 나타나지 않는다.")
        print("① 1문단에서 건의 사항을 해결해 줄 수 있는 주체인 '학생회 운영진'을 예상 독자로 명시하고 있다. ③ 2문단에서 체육대회 경기에 참가할 수 있는 기회가 모두에게 제공되지 못한다는 공동체가 당면한 문제를 제시하고 있다. ④ ㈎에는 공식적인 글쓰기의 상황을 고려한 격식체와 높임 표현이 사용되고 있다. ⑤ 쌍방향적 소통이 가능한 매체의 특성을 고려하여 5문단에서 댓글을 통한 상대방의 응답을 요구하고 있다.")
    five = input("Please enter the correct answer to question 5: ")
    five = int(five)
    if five == 3:
        five_score = 2
        print("정답입니다!")
    else:
        five_score = 0
        print("5번: 3")
        print("3문단에 따르면, 두 종목을 선택하게 된 근거로 신체적인 제약을 크게 받지 않는다는 점을 제시하고 있으며 국제 대회의 정식 종목으로 채택되었다는 것이 이 스포츠를 체육대회 운영 종목으로 선택한 근거이다.")
        print("① 2문단에서 체육대회가 학생들의 성취감, 단합력을 높이기 위해 개최된다는 취지를 확인하면서 문제 해결의 필요성을 드러내고 있다. ② 2문단에서 현재 체육대회 종목인 농구, 축구 등이 운동 능력이 좋은 친구들에게 유리한 종목임을 언급하여 문제 상황의 원인을 제시하고 있다. ④ 3문단에서 장기보다는 학생들이 더 잘 알고 선호하는 이 스포츠를 채택해 달라고 하고 있다. ⑤ 3문단에서 현재 체육대회의 문제점을 해결할 수 있는 방법으로 장기와 이 스포츠를 새로운 운영 종목으로 추가해 달라고 제안하고 있다.")
    six = input("Please enter the correct answer to question 6: ")
    six = int(six)
    if six == 2:
        six_score = 3
        print("정답입니다!")
    else:
        six_score = 0
        print("6번: 2")
        print("㈏의 '학생 2'는 현재 체육대회 종목의 운영 방식을 확인하고 이것을 이 스포츠에 적용하자는 내용으로 논의의 결론을 제시하고 있다. ㈎의 2문단에서 제시했던 현재 체육대회 종목 구성의 한계와 관련지어 제시된 의견을 절충하고 있지 않다.")
        print("① ㈎에서 운영 종목 다양화의 필요성에 대해 제시한 것을 다시 진술해 확인하면서, 두 종목을 체육대회 종목으로 추가할지 회의해 보자며 논의해야할 주제를 제시하고 있다. ③ ㈎에서 이 스포츠를 체육대회에 추가하는 것에 대한 우려를 언급한 것과 관련하여 스포츠의 의미를 토대로 운영 종목으로서의 적합성을 판단하고 있다. ④ ㈎에서 언급한 장기, 이 스포츠 중 이 스포츠만 체육대회 종목으로 추가하자고 논의의 범위를 줄인 후, 이 스포츠를 운영할 때 유의해야 할 점을 추가적인 논의 사항으로 제시했다. ⑤ ㈎에서 이 스포츠가 국제 대회의 정식 종목으로 채택되었다는 정보를 언급한 것과 관련하여 신문 기사를 찾아보며 자료를 탐색한 결과를 공유하고 있다.")
    seven = input("Please enter the correct answer to question 7: ")
    seven = int(seven)
    if seven == 2:
        seven_score = 2
        print("정답입니다!")
    else:
        seven_score = 0
        print("7번: 2")
        print("'학생 3'은 '학생 1'의 발언에 대해 '그래.'라고 동의를 한 후, 자신의 반에도 프로 게이머를 희망하는 친구가 5명 있다는 구체적 사례를 제시하여 '학생 1'의 의견을 뒷받침해 주고 있다.")
        print("① '학생 3'은 '학생 1'의 발언을 반영하고 있으나 자신이 제시한 의견을 보충하고 있지는 않다. ③ '학생 3'은 '학생 1'의 발언과 자신의 의견이 다른 부분을 확인하고 있지는 않다. ④ '학생 1'은 추가적인 정보를 요청하고 있으나, '학생 3'의 발언을 구체화하고 있지 않다. ⑤ '학생 1'은 자신의 의견에 대한 동의를 구하고 있지 않다.")
    eight = input("Please enter the correct answer to question 8: ")
    eight = int(eight)
    if eight == 3:
        eight_score = 2
        print("정답입니다!")
    else:
        eight_score = 0
        print("8번: 3")
        print("학생의 초고에는 나트륨 함량 비교표시제의 도입 과정을 설명하고 있지 않다.")
        print("① 1문단에서 ' 수분량을 조절하고 ~ 흡수를 돕는 등' 나트륨을 섭취해야 하는 이유를 언급하고 있다. ② 4문단에서 '영양성분 표시를 ~ 주문하는 방법'과 같이 나트륨 섭취를 줄일 수 있는 방법을 설명하고 있다. ④ 3문단에서 구매하는 식품의 나트륨 함량 정보를 더욱 쉽게 알 수 있게 해 준다는 나트륨 함량 비교표시의 효용적 측면을 부각하고 있다. ⑤ 4문단에서 치킨, 튀김, 만두 등 나트륨이 많이 들어 있는 식품의 종류를 언급하고 있다.")
    nine = input("Please enter the correct answer to question 9: ")
    nine = int(nine)
    if nine == 4:
        nine_score = 3
        print("정답입니다!")
    else:
        nine_score = 0
        print("9번: 4")
        print("ㄱ-2는 영양성분 표시 확인이 나트륨 섭취량에 미치는 영향을, ㄴ은 나트륨 과다 섭취가 청소년에게 특히 위험하다는 것을 드러낸 자료이다. ㄱ-2와 ㄴ에는 채소나 과일을 많이 섭취해야 한다는 내용은 없으므로 채소와 과일을 많이 섭취해야 한다는 근거로 활용하기에는 적절하지 않다.")
        print("① ㄱ-1은 한국인의 연령별 1일 나트륨 섭취량이 WHO 권고 섭취량보다 많다는 것을 보여주는 자료이므로 우리나라 청소년들의 1일 나트륨 섭취량이 많다는 것을 언급한 2문단을 구체화하는 자료로 활용하기에 적절하다. ② ㄴ은 청소년의 나트륨 과다 섭취가 위험하다는 것을 알려주는 자료이므로 과다 섭취의 위험성을 언급한 1문단에 추가하기 적절하다. ③ ㄷ은 '유탕면류 ~ 샌드위치'라고 나트륨 함량 비교표시 대상 식품을 언급하고 있으므로 나트륨 함량 비교표시에 대해 설명한 3문단에 추가하기에 적절하다. ⑤ ㄱ-2는 영양성분 표시를 확인하는 사람이 그렇지 않은 사람에 비해 나트륨을 더 적게 섭취한다는 것을, ㄷ은 영양성분 표시를 통해 식품에 첨가된 나트륨량을 확인할 수 있다는 것을 보여주는 자료이므로 영양성분 표시를 확인하자는 4문단에 그 이유로 제시하기에 적절하다.")
    ten = input("Please enter the correct answer to question 10: ")
    ten = int(ten)
    if ten == 1:
        ten_score = 2
        print("정답입니다!")
    else:
        ten_score = 0
        print("10번: 1")
        print("'고친 글'에는 [A]에서 의미가 중복되어 사용된 '과다하게'와 '너무 많이' 중 '과다하게'가 삭제되었고, '덜어 내고'와 '실천하여'가 필요로 하는 문장 성분인 목적어 '나트륨을'과 '나트륨 줄이기를'이 추가되었다.")
    eleven = input("Please enter the correct answer to question 11: ")
    eleven = int(eleven)
    if eleven == 4:
        eleven_score = 2
        print("정답입니다!")
    else:
        eleven_score = 0
        print("11번: 4")
        print("'독서[독써]'는 'ㅅ'이 'ㅆ'으로 교체된 결과로 음운 개수의 변동이 없고, '[써]'는 음절 유형이 '자음+모음'이다.")
    twelve = input("Please enter the correct answer to question 12: ")
    twelve = int(twelve)
    if twelve == 5:
        twelve_score = 2
        print("정답입니다!")
    else:
        twelve_score = 0
        print("12번: 5")
        print("'차다'라는 하나의 말소리가 '(발로) 차다', '(날씨가) 차다', '(명찰을) 차다' 등의 다양한 의미에 대응하는 것은 말소리와 의미의 관계가 필연적이지 않고 자의적임을 보여주는 언어의 자의성에 해당하는 사례이다.")
        print("① 언어를 통해 연속적인 대상이나 개념을 분절적으로 인식하는 언어의 분절성에 대한 사례이므로 적절하다. ②, ④ 말소리와 의미가 관습적으로 결합되어 있어 그 결합은 개인이 함부로 바꿀 수 없는 약속임을 보여 주는 언어의 사회성에 대한 사례이므로 적절하다. ③ 말소리와 의미의 관계가 필연적이지 않음을 보여주는 언어의 자의성에 대한 사례이므로 적절하다.")
    thirteen = input("Please enter the correct answer to question 13: ")
    thirteen = int(thirteen)
    if thirteen == 3:
        thirteen_score = 3
        print("정답입니다!")
    else:
        thirteen_score = 0
        print("13번: 3")
        print("'싸다'는 '그 정도의 값어치가 있다'에서 비용이 보통보다 낮다'로 의미가 이동했으며, 첫째 음절에서 '·'가 'ㅏ'로 바뀌어 음운의 변화로 인한 형태 변화를 겪었으므로 ㉠과 ㉡에 모두 해당한다.")
        print("① '어리다'는 의미 이동이 일어났으나 형태 변화는 일어나지 않은 단어이므로 적절하지 않다. ② '서울'은 음운의 변화로 인한 형태 변화가 일어났으나 의미가 확대된 단어이므로 적절하지 않다. ④ '마음'은 음운의 변화로 인한 형태 변화가 일어났으나 의미가 축소된 단어이므로 적절하지 않다. ⑤ '서로'는 유추에 의한 형태 변화가 일어난 단어이므로 적절하지 않다.")
    fourteen = input("Please enter the correct answer to question 14: ")
    fourteen = int(fourteen)
    if fourteen == 1:
        fourteen_score = 2
        print("정답입니다!")
    else:
        fourteen_score = 0
        print("14번: 1")
        print("㉠은 책을 두고 온 곳, 처소에 해당하는 '집' 뒤에 붙는 것이므로 처소의 부사격 조사 '에'와 보조사 '요'가 결합한 '에요'가 들어가야 한다. ㉡은 '이나다'의 어간 뒤에 붙는 것이므로 '에요'가 들어가야 한다. ㉢은 받침이 있는 체언인 '학생' 뒤에 결합하는 것이므로 '이에요'가 들어가야 한다.")
    fifteen = input("Please enter the correct answer to question 15: ")
    fifteen = int(fifteen)
    if fifteen == 2:
        fifteen_score = 2
        print("정답입니다!")
    else:
        fifteen_score = 0
        print("15번: 2")
        print("㉠, ㉡의 '보다'는 '책이나 신문 따위를 읽다'라는 의미로 쓰였으므로 동사이며, ㉠, ㉡ 중 띄어쓰기가 바르게 된 것은 ㉠이다. ㉢, ㉣의 '보다'는 '나'라는 체언에 결합하여 '~에 비해서'라는 뜻을 나타내며 조사이며 조사는 앞말에 붙여 쓰므로 ㉢, ㉣ 중 띄어쓰기가 바르게 된 것은 ㉣이다. ㉤, ㉥의 '보다'는 '어떤 수준에 비하여 한층 더'라는 의미로 쓰였으므로 부사이며, ㉤, ㉥ 중 띄어쓰기가 바르게 된 것은 ㉤이다.")
    sixteen = input("Please enter the correct answer to question 16: ")
    sixteen = int(sixteen)
    if sixteen == 4:
        sixteen_score = 2
        print("정답입니다!")
    else:
        sixteen_score = 0
        print("16번: 4")
        print("㈏의 3문단에서 묻고 답하는 방식을 활용하고 있으나 이를 통하여 저작권 침해가 발생하는 경우를 나열하고 있지는 않다.")
        print("① ㈎의 3문단에서 원저작물과 시장적 경쟁 관계에 있는지 여부에 따라 2차적저작물과 독립저작물을 구분하고 있다. ② ㈎의 2문단에서 소설, 영화의 예시를 활용하여 원저작물과 실질적 유사성을 유지해야 한다는 요건과 근대 소설, 소설, 영화의 예시를 활용하여 새로운 창작성을 부가하여야 한다는 요건을 설명하고 있다. ③ ㈏의 1문단에서 저작인격권과 저작재산권의 차이점을 밝히며 이 둘을 구별하고 있다. ⑤ ㈎의 1문단에서 저작권법 제2조 제1호에 근거하여 '저작물'을 설명하고 있으며, ㈏의 2문단에서 저작권법 제22조에 근거하여 '2차적저작물 작성권'을 설명하고 있다.")
    seventeen = input("Please enter the correct answer to question 17: ")
    seventeen = int(seventeen)
    if seventeen == 5:
        seventeen_score = 2
        print("정답입니다!")
        print("")
    else:
        seventeen_score = 0
        print("17번: 5")
        print("㈏의 1문단에 따르면, 지적재산권은 저작물을 일정한 방식으로 이용함으로써 발생하는 재산적 이익을 보호하기 위한 권리이며 2문단에 따르면, 2차적저작물 작성권은 저작재산권을 구성하는 권리 중 하나로 2차적저작물을 작성하여 이용할 권리이다. 그러므로 2차적저작물 작성권은 2차적저작물을 작성하여 이용함으로써 발생하는 재산적 이익을 보호하기 위한 권리이다.")
        print("① ㈏의 1문단에 따르면, 저작인격권은 양도할 수 없으며 저작자가 사망하면 소멸한다. ② ㈏의 1문단에 따르면, 저작권은 저작자가 자신이 창작한 저작물에 대해 갖는 권리이며 3문단에 따르면, 일단 2차적저작물이 만들어지면 2차적저작물의 저작권은 원저작물의 저작권과는 별개의 권리로서 보호를 받으며 원저작자의 허락이 있었는지 여부는 2차적저작물의 저작권 발생에 영향을 주지 않는다. 이를 통해 2차적저작물 작성권이 없는 사람이 2차적저작물을 창작한 경우 2차적저작물의 저작권은 2차적저작물의 창작자가 갖게 됨을 알 수 있다. ③ ㈎의 2문단에 따르면, 근대소설을 현대 표기법에 맞도록 수정한 것은 원저작물의 복제물에 가까운 것으로 2차적저작물로 보기 어렵다. ④ ㈎의 1문단에 따르면, 우연히 기존의 저작물과 유사하더라도 베끼지 않고 독자적으로 창작한 것이라면 저작권 보호를 받을 수 있다.")
    eighteen = input("Please enter the correct answer to question : ")
    eighteen = int(eighteen)
    if eighteen == 5:
        eighteen_score = 2
        print("정답입니다!")
    else:
        eighteen_score = 0
        print("18번: 5")
        print("㈏의 4, 5문단에 따르면, ㉡과 ㉢을 작성할 때에는 모두 ㉠의 2차적저작물 작성권을 가진 사람의 허락을 받을 필요가 있다.")
        print("① ㈏의 1문단에 따르면, 원저작자는 저작재산권을 구성하는 각각의 권리를 나누어 일부를 양도할 수 있으며, 2문단에 따르면, 2차적저작물 작성권은 저작재산권을 구성하는 권리 중 하나이다. 이를 통해 ㉠의 저작자와 ㉡을 작성하여 이용할 수 있는 권리를 가진 사람은 다를 수 있음을 알 수 있다. ② ㈎의 2문단에 따르면, ㉡은 ㉠을 기초로 하여 작성된 것이다. ③ ㈎의 3문단에 따르면, 2차적저작물은 원저작물과 시장적 경쟁관계에 있다고 보는 것이 일반적이다. ㉡은 ㉢의 원저작물이며 ㉢은 ㉡의 2차적저작물이므로 ㉡과 ㉢은 시장적 경쟁 관계에 있다고 보는 것이 일반적이다. ④ ㈎의 2문단에 따르면, 2차적저작물은 원저작물과 실질적 유사성을 유지하고 있다. ㈏의 5문단에 따르면, ㉢을 제작할 때는 ㉠의 2차적저작물 작성권을 가진 사람의 허락을 받을 필요가 있다. 이를 통해 ㉢을 ㉠의 2차적저작물로 볼 수 있음을 알 수 있으며, ㉢은 ㉠과 실질적 유사성이 있다고 간주할 수 있다.")
    nineteen = input("Please enter the correct answer to question 19: ")
    nineteen = int(nineteen)
    if nineteen == 3:
        nineteen_score = 2
        print("정답입니다!")
    else:
        nineteen_score = 0
        print("19번: 3")
        print("㉮를 통해 저작권법에 의해 2차적저작물이 독자적인 저작물로서 보호받음을 알 수 있다. ㈎의 1문단에 따르면, 저작권법으로 보호받는 저작물이 되려면 창작성이 있어야 하며, 2문단에 따르면, 2차적저작물에는 원저작물에는 없는 새로운 창작성이 부가되어 있다. 이를 통해 2차적저작물이 저작권법으로 보호받는 이유를 원저작물에 없는 새로운 창작성이 부가되어 있기 때문이라고 추론할 수 있다.")
    twenty = input("Please enter the correct answer to question 20: ")
    twenty = int(twenty)
    if twenty == 5:
        twenty_score = 3
        print("정답입니다!")
    else:
        twenty_score = 0
        print("20번: 5")
        print("④, ⑤ ㈏의 2문단에 따르면, 원저작자 허락 없이 원저작물에 의거하여 그 저작물과 실질적으로 유사한 저작물을 작성하여 이용한다면 그 사람은 원저작자의 2차적저작물 작성권을 침해한 것이다. A는 기존 가요의 저작권을 가지고 있는 B에게 허락을 받지 않고 기존 가요를 편곡하였으므로 B의 2차적저작물 작성권을 침해하였다. C는 D가 작성한 한글 자막을 무단으로 이용한 것은 맞지만, 이 한글 자막을 원저작물로 하여 2차적저작물을 작성하여 이용한 것은 아니다. 그러므로 B는 2차적저작물을 침해받았으나 D는 침해받지 않았다.")
        print("① ㈏의 1문단에 따르면, 저작권은 저작자가 자신이 창작한 저작물에 대해 갖는 권리이다. 3문단에 따르면, 원저작자의 허락이 있었는지 여부는 2차적저작물의 저작권 발생에 영향을 주지 않는다. 저작자가 아닌 다른 사람에게 양도된 저작권이 없다고 가정하면 A가 편곡하여 블로그에 올린 곡에 대한 저작권은 저작자인 A가 가지고 있다. ② ㈏의 4문단에 따르면, 원저작자는 자기 허락 없이 2차적저작물을 작성하여 이용한 사람에게 손해배상을 청구할 수 있다. D는 영어 자막의 저작자에게 허락을 받지 않고 영어 자막을 번역하여 한글 자막을 작성하였으므로, 영어 자막의 저작자는 D에게 손해배상을 청구할 수 있다. ③ ㈎의 2문단에 따르면, 저작권법상 원저작물을 번역·편곡·변형·각색 등의 방법으로 작성한 창작물을 2차적저작물이라 한다. A는 기존 가요를 편곡하였고 D는 영어 자막을 번역하여 한글 자막을 작성하였으므로 기존 가요와 영어 자막은 원저작물로 볼 수 있다.")
    twenty_one = input("Please enter the correct answer to question 21: ")
    twenty_one = int(twenty_one)
    if twenty_one == 1:
        twenty_one_score = 2
        print("정답입니다!")
    else:
        twenty_one_score = 0
        print("21번: 1")
        print("'저작인격권과 저작재산권으로 나눌 수 있다'의 '나눌'은 '종류에 따라서 가를'의 의미로 쓰였으므로 '분류(分類)할'로 바꾸어 쓸 수 있다.")
        print("② '변별(辨別)하다'는 '사물의 옳고 그름이나 좋고 나쁨을 가리다'의 의미이므로 바꾸어 쓰기에 적절하지 않다. ③ '배분(配分)하다'는 '몫몫이 별러 나누다'의 의미로 바꾸어 쓰기에 적절하지 않다. ④ '판별(判別)하다'는 '옳고 그름이나 좋고 나쁨을 판단하여 구별하다'의 의미이므로 바꾸어 쓰기에 적절하지 않다. ⑤ '해석(解釋)하다'는 '문장이나 사물 따위로 표현된 내용을 이해하고 설명하다, 사물이나 행위 따위의 내용을 판단하고 이해하다'의 의미이므로 바꾸어 쓰기에 적절하지 않다.")
        print("")
    twenty_two = input("Please enter the correct answer to question 22: ")
    twenty_two = int(twenty_two)
    if twenty_two == 3:
        twenty_two_score = 2
        print("정답입니다!")
    else:
        twenty_two_score = 0
        print("22번: 3")
        print("2문단에 따르면, 프롬은 인간과 다른 동물을 구분 지을 수 있는 특성이자 인간의 본질을 이성으로 파악했음을 알 수 있다. 하지만 프롬은 인간이 다른 동물과 달리 이성을 가지고 있는 이유를 설명하지는 않았다.")
        print("① 6문단에 따르면, 프롬은 현대 사회의 병리적 현상의 원인을 현대 사회가 끝없는 소비를 조장하여 무한한 이윤을 추구하는 소유지향적 사회이기 때문이라고 보았음을 알 수 있다. ② 5문단에 따르면, 프롬은 학습이 소유적 실존양식을 따르는 사람에게는 권력 추구의 수단이 되지만 존재적 실존양식을 따르는 사람에게는 내면의 새로운 사고를 촉발하는 과정이 된다고 보았음을 알 수 있다. ④ 6문단에 따르면, 프롬은 사회의 주된 실존양식은 그 사회의 구조와 규범에 따라 결정된다고 보았음을 알 수 있다. ⑤ 4문단에 따르면, 프롬은 존재적 실존양식 아래에서 사람들은 가진 것을 잃을 수 있다는 불안에 시달리지 않으므로 다른 존재에게 호의적이라고 보았음을 알 수 있다.")
    twenty_three = input("Please enter the correct answer to question 23: ")
    twenty_three = int(twenty_three)
    if twenty_three == 2:
        twenty_three_score = 2
        print("정답입니다!")
    else:
        twenty_three_score = 0
        print("23번: 2")
        print("3문단에 따르면, 프롬은 생존을 위해 필요한 최소한의 소유는 부정하지 않았음을 알 수 있다. 따라서 A의 의문에 대해 프롬은 삶을 영위하기 위한 기본적인 소유는 불가피하다고 답변했을 것이다. 또 3문단에 따르면, 프롬은 소유를 통해 행복의 원천을 발견하려는 집착적 욕망에는 포화점이 없으며, 소유를 통해서는 인간의 근원적 불안과 외로움을 극복할 수 없다고 하였음을 알 수 있다. 따라서 A의 의문에 대해 프롬은 소유를 통해 행복을 찾으려는 욕망은 완전히 채워질 수 없다고 답변했을 것이다.")
        print("① 3문단에 따르면, 프롬은 이미 소유한 것은 더 이상 충족감을 줄 수 없으며 소유를 통해서는 인간의 근원적 불안과 외로움은 극복될 수 없다고 하였다. ③, ⑤ 3문단에 따르면, 프롬은 최소한의 소유를 부정하지는 않았다. ④ 프롬은 행복에 대한 욕망을 버려야 한다고 보지는 않았다.")
    twenty_four = input("Please enter the correct answer to question 24: ")
    twenty_four = int(twenty_four)
    if twenty_four == 3:
        twenty_four_score = 2
        print("정답입니다!")
    else:
        twenty_four_score = 0
        print("24번: 3")
        print("4문단에 따르면, 세계와 합일을 이루기 위해서는 이성적 능력을 생산적으로 사용해야 하며, '생산적'이라는 것은 쓸모 있는 결과물을 만들어 내는 능력이 아니라 내면의 능동적인 상태를 의미한다고 했다. 따라서 유용한 결과물을 생산하는 것은 행복을 실현할 수 있는 조건으로 볼 수 없다.")
        print("① 3문단에 따르면, 소유적 실존양식 아래에서 사람들은 소유에 대한 탐욕을 느끼며, 이는 소유물을 차지하기 위한 경쟁의 욕구를 불러일으킨다. ② 3문단에 따르면, 소유적 실존양식 아래에서 사람들은 자신의 소유물을 지키며 타인의 소유물을 뺴앗을 수 있는 권력을 차지하는 것에서 행복을 찾으려고 한다. ④ 4문단에 따르면, 존재적 실존양식 아래에서 사람들은 가진 것을 잃을 수 있다는 불안을 느끼지 않으므로 다른 존재에 대해 호의적이며, 타인을 사랑하고 자신이 가진 것을 나눔으로써 다른 존재의 성장을 도우려고 한다. ⑤ 5문단에 따르면, 프롬은 각 실존양식이 일상생활에서 사용하는 물건들과 지식·사상 등과 같은 관념적 대상에 적용되는 삶의 방식이라고 보았음을 알 수 있다.")
    twenty_five = input("Please enter the correct answer to question 25: ")
    twenty_five = int(twenty_five)
    if twenty_five == 2:
        twenty_five_score = 3
        print("정답입니다!")
    else:
        twenty_five_score = 0
        print("25번: 2")
        print("<보기>는 인간이 사회에 책임을 지는 시민으로서 정치적 행복을 느낄 수 있다고 하였으나, 개인이 사회적 변혁을 이끌어야 한다고 하지는 않았다.")
        print("① 6문단에 따르면, 프롬은 사회의 구조와 규범에 따라 주된 실존양식이 결정된다고 보았음을 알 수 있다. <보기>는 공동체의 훈육을 통해 인간의 덕이 개발되므로 인간은 사회를 떠나 행복할 수 없다고 보았다. 따라서 프롬과 <보기> 모두 인간의 행복이 사회의 영향을 받는다고 보았다. ③ 4문단에 따르면, 프롬은 이성적 능력을 생산적으로 사용해야 세계와 합일을 이룰 수 있다고 보았는데, 이떄 생산적이라는 것은 내면의 능동적인 상태를 의미한다. <보기>는 최고의 행복이 이성적 사고를 통해 세상의 질서를 깨닫는 것이라고 보았다. ④ 2문단에 따르면, 프롬은 인간은 이성을 가진 존재로서 실존적 한계를 느끼며, 실존적 한계를 극복하고 세계와 합일을 이룰 때 행복에 도달 할 수 있다고 보았음을 알 수 있다. <보기>는 행복은 덕의 실현이 습관화되었을 때 도달할 수 있는 경지이므로 그 사람의 인격적 성숙에 따라 평가해야 한다고 보았다. ⑤ 3문단에 따르면, 프롬은 소유적 실존양식 아래에서 사람들은 소유를 통해 감각적 욕망을 충족시킬 수 있지만, 소유에 대한 탐욕은 충족되지 않기 때문에 행복을 느낄 수 없다고 보았음을 알 수 있다. <보기>는 감각적 욕망의 충족이 지나칠 경우 거부감을 줄 수 있지만 행복한 삶을 누리기 위해서 세 가지 행복을 함께 구현해야 한다고 보았다. 따라서 <보기>는 감각적 욕망의 행복한 삶을 누리기 위한 조건이라고 보았음을 알 수 있다.")
    twenty_six = input("Please enter the correct answer to question 26: ")
    twenty_six = int(twenty_six)
    if twenty_six == 5:
        twenty_six_score = 2
        print("정답입니다!")
    else:
        twenty_six_score = 0
        print("26번: 5")
        print("㈏는 <제9수> '팔목 쥐시거든 ~받치리라', '나갈 데 계시거든 ~좇으리라'에서, ㈏는 '~는 용서의 말', '~는 격려의 말' 등에서 유사한 구조의 어구를 활용하여 삶의 태도를 드러대고 있다.")
    twenty_seven = input("Please enter the correct answer to question 27: ")
    twenty_seven = int(twenty_seven)
    if twenty_seven == 5:
        twenty_seven_score = 2
        print("정답입니다!")
    else:
        twenty_seven_score = 0
        print("27번: 5")
        print("㉠은 화자가 행동의 실천, 즉 '옳은 일'을 실천하기를 바라는 대상이고 ㉡은 글쓴이에게 '이 세상은 ~ 있는 곳'이라는 깨달음의 계기를 제공하는 대상이다.")
        print("③ ㉡은 글쓴이에게 긍정적인 경험을 제공하는 대상이지만 글쓴이가 동질감을 느끼는 대상으로는 보기 어렵다.")
    twenty_eight = input("Please enter the correct answer to question 28: ")
    twenty_eight = int(twenty_eight)
    if twenty_eight == 1:
        twenty_eight_score = 3
        print("정답입니다!")
    else:
        twenty_eight_score = 0
        print("28번: 1")
        print("<제1수>는 비유적 표현을 활용하여 '두 분'의 '은덕'이 '하늘'과 같다고 설명하고 있을 뿐 청자에게 권위 있다고 인정받는 경전에 기대고 있지 않다.")
        print("② <제7수>는 '효경'과 '소학'을 배우는 것을 원인으로, '어질'게 되는 것을 결과로 볼 수 있으므로 인과 관계 활용하기 전략을 활용한다고 볼 수 있다. ③ <제8수>는 '옳은 일'을 하지 않는 사람을 '마소'라고 하는 흑백 사고 활용하기 전략을 활용한다고 볼 수 있다. ④ <제9수>는 '두 손으로 받치'고 '막대 들고'의 행동은 어른을 어떻게 공경해야 하는지에 대한 사례 제시하기 전략을 활용한다고 볼 수 있다. ⑤ <제13수>는 '내 논 다 매거든 네 논 좀 매어'와 같이 상부상조의 정신이 드러나는 구체적인 모습을 보여 주는 사례 제시하기 전략을 활용한다고 볼 수 있다.")
    twenty_nine = input("Please enter the correct answer to question 29: ")
    twenty_nine = int(twenty_nine)
    if twenty_nine == 4:
        twenty_nine_score = 2
        print("정답입니다!")
    else:
        twenty_nine_score = 0
        print("29번: 4")
        print("㈏는 다른 사람의 어려운 처지를 이해하고 감싸 주며 배려하는 태도가 희망을 줄 수 있다는 깨달음을 잘 드러내는 수필로, 삶에 좌절하고 희망을 잃었던 사람들의 이야기는 나오지 않는다.")
        print("① 골목 안 친구들이 고무줄놀이나 달리기를 하면 '나'에게 심판을 시켰다는 내용에서 골목길 안에서 아이들과 놀던 작가의 어린 시절을 확인할 수 있다. ② 공기놀이 외에는 그 어떤 놀이에도 참여할 수 없었던 '나'가 소외감이나 박찰감을 느끼지 않도록 친구들이 배려한 준 것이나 깨엿 장수가 '괜찮아'라고 말해 준 일화에서 주변에 작가를 배려해 주는 좋은 사람들이 있었음을 확인할 수 있다. ③ 깨엿 장수와의 일화를 통해 작가가 이 세상은 그런대로 살 만한 곳이라는 긍정적인 생각으로 희망을 품고 살아갈 수 있는 사람이 되었음을 확인할 수 있다.")
    thirty = input("Please enter the correct answer to question 30: ")
    thirty = int(thirty)
    if thirty == 3:
        thirty_score = 2
        print("정답입니다!")
    else:
        thirty_score = 0
        print("30번: 3")
        print("3문단에 따르면, 석빙고 내부의 따뜻해진 공기는 밀도의 변화에 따른 이동을 통해 아치형 천장의 상부 통풍구로 빠져나간다. 이러한 에너지의 이동이 내부를 차갑게 하는 것이지 외부 공기를 이용하는 것은 아니다.")
        print("① 5문단에 따르면, 석빙고 외부에 심은 풀이 태양의 복사 에너지로 인한 내부 온도 상승을 막는 데 도움을 준다는 것을 알 수 있다. ㅓ② 1문단에 따르면, 석빙고는 내부를 냉각시킨 후 얼음을 저장한다는 것을 알 수 있다. ④ 5문단에 따르면, 빙실은 온도 유지를 위해 주변 지반에 비해 낮게 만들었음을 알 수 있다. ⑤ 3문단에 따르면, 통풍구의 덮개돌이 얼음에 영향을 줄 수 있는 직사광선이나 빗물을 차단하는 역할을 함을 알 수 있다.")
    thirty_one = input("Please enter the correct answer to question 31: ")
    thirty_one = int(thirty_one)
    if thirty_one == 4:
        thirty_one_score = 2
        print("정답입니다!")
    else:
        thirty_one_score = 0
        print("31번: 4")
        print("얼음은 물로 상태변화가 일어날 때 주변으로부터 에너지를 흡수하고 이에 따라 주변 공기가 차가워진다. 즉, 상태변화가 일어나 생긴 물은 같은 온도의 얼음에 비해 더 큰 에너지를 가지고 있음을 알 수 있다. 그러므로 물의 에너지가 얼음으로 전달되어 얼음이 녹는 것을 막기 위해 물을 빨리 제거하여야 함을 알 수 있다.")
        print("① 에너지는 높은 곳에서 낮은 곳으로 이동하므로 에너지가 상대적으로 낮은 얼음으로부터 물이 에너지를 전달받을 수 없다. ② 얼음이 녹아 생긴 물은 에너지를 흡수하거나 방출하는 물질로 보는 것은 적절하지 않다. ③ 물이 상태변화를 통해 내부의 온도 상승에 영향을 주기 위해서는 응고열을 방출하는, 즉 물이 다시 얼음이 되는 상태변화가 일어나야 한다. 하지만 주변 에너지가 커 얼음을 녹게 하는 상황에서 다시 얼움으로의 상태변화는 일어나기 어렵다. ⑤ 얼음이 녹아 생긴 물은 같은 양의 얼음보다 에너지가 클 것이며, 이를 녹게 한 주변 공기는 더 큰 에너지를 가지고 있을 것이다. 에너지의 차이가 있는 상태에서 에너지의 평형을 이루었다는 설명은 부적절하다.")
    thirty_two = input("Please enter the correct answer to question 32: ")
    thirty_two = int(thirty_two)
    if thirty_two == 1:
        thirty_two_score = 2
        print("정답입니다!")
    else:
        thirty_two_score = 0
        print("32번: 1")
        print("2문단에 따르면, 여름철 석빙고 안에서는 몰질의 융해가 일어난다. 이때 물질이 주변에서 융해열을 흡수하여 주변 물질은 에너지가 감소한다. 이러한 상태변화가 일어나는 동안 물질의 온도는 유지된다.")
        print("⑤ 물질이 응고될 경우 응고열을 방출하여 주변 물질의 에너지가 증가할 수 있으나, 이러한 상태 변화는 여름철 석빙고 내부에서 일어나지 않는다.")
    thirty_three = input("Please enter the correct answer to question 33: ")
    thirty_three = int(thirty_three)
    if thirty_three == 3:
        thirty_three_score = 3
        print("정답입니다!")
    else:
        thirty_three_score = 0
        print("33번: 3")
        print("B의 물이 눈 벽돌 사이를 메우면서 얼어 만들어진 얼음 벽은 외부와의 공기 출입을 막는 역할을 하는 것은 적절하다. 그러나 4문단에 따르면, A의 얼음 사이의 짚은 접촉하고 있는 두 물질 사이에 에너지가 잘 전달되지 않도록 하는 것이므로 석빙고 외부와의 공기 출입과는 무관하다.")
        print("① B의 얼음 벽은 내부의 에너지 유출을 막는다는 것을 <보기>를 통해 알 수 있다. 이와 달리 5문단에 따르면, A의 외부 흙은 내부로 유입되는 에너지 차단을 위한 것이지 외부로의 에너지 유출을 막기 위한 것이 아니다. ② 4문단에 따르면, A의 짚이 비어 있는 것은 단열 효과를 높일 수 있음을 알 수 있다. <보기>에서 B의 눈 벽돌이 녹았다가 얼 때 공기가 얼음속에 갇히며 공기층이 생길 것을 알 수 있는 데, 이는 결국 스티로폼처럼 공기구멍을 많이 포함한 것으로 볼 수 있다. 이는 단열 효과를 높일 것이므로 해당 설명은 적절하지 않다. ④ 3문단에 따르면, A는 공기의 온도가 상승하면 밀도가 낮아짐으로써 에너지를 동반하여 위로 이동하는 현상을 내부 온도 유지에 활용함을 알 수 있다. B는 눈 벽돌을 쌓아 올인 후 불을 피우게 되는데, 공기의 온도가 높아지면서 공기가 순환한다는 사실을 <보기>를 통해 확인할 수 있다. 따라서 둘 모두 공기의 밀도 변화에 따른 에너지의 이동이 나타난다는 설명은 적절하다. ⑤ 1문단에 따르면, A는 얼음을 저장하기 전 내부를 냉각시키기 위해 출입구를 개방한다. B는 내부의 온도 상승으로 눈 벽돌이 녹아 물이 생기면 이 물을 얼도록 하는데, 이떄 출입구를 열어 온도를 낮추어야 함을 <보기>를 통해 알 수 있다. 따라서 A와 B 모두 내부 온도를 낮추기 위해 출입구를 활용한다는 설명은 적절하다.")
    thirty_four = input("Please enter the correct answer to question 34: ")
    thirty_four = int(thirty_four)
    if thirty_four == 1:
        thirty_four_score = 2
        print("정답입니다!")
    else:
        thirty_four_score = 0
        print("34번: 1")
        print("ⓐ는 '다른 나라의 장치에 비해서도 기술이 떨어지지 않는'의 맥락에서 사용되었으므로 '다른 것보다 수준이 처지거나 못하다'라는 의미로 쓰였다.")
        print("②에서 '떨어지다'는 '명령이나 허락 따위가 내려지다'라는 의미로 쓰였다. ③에서 '떨어지다'는 '정이 없어지거나 멀어지다'라는 의미로 쓰였다. ④에서 '떨어지다'는 '함께 하거나 따르지 않고 뒤에 처지다'라는 의미로 쓰였다. ⑤에서 '떨어지다'는 '말이 입 밖으로 나오다'라는 의미로 쓰였다.")
    thirty_five = input("Please enter the correct answer to question 35: ")
    thirty_five = int(thirty_five)
    if thirty_five == 5:
        thirty_five_score = 2
        print("정답입니다!")
    else:
        thirty_five_score = 0
        print("35번: 5")
        print("만수의 여동생은 만수가 진주를 데리고 와서 '여자들한테는 양보할 수 없는 고유 영역 같은' 주방을 맡기라고 했던 첫 만남에서부터 '말도 안 되는 소리'라며 반감을 느낀다. 이런 부정적인 감정은 이후 분식집 대신 새로 차린 기사 식당에서도 그대로 이어진다. 따라서 진주에 대한 만수 여동생의 생각은 처음부터 이로간된 것이며, 바뀐 것이 아니다.")
        print("① '만수 씨를 처음 봤을 때부터 좋아하고 있었다'라는 진주의 서술을 통해 확인할 수 있다. ② '제가 아무리 아니라고 해도 사람들이 의심을 더 하니까'라는 만수의 말을 통해 확인할 수 있다. ③ '우리가 공장을 지키기 위해서 싸우다 보면 ~ 희망 때문에 싸우는 거야'라는 만수의 말을 통해 확인 할 수 있다. ④ '누구는 자기 하고 싶은 대로 멋대로 일했다 말았다 하고 월급은 사장보다 더 챙겨가고 누구는 하루 스물네 시간 꼬박 일하고 있는데'와 '돈 생기는 데는 기사 식당밖에 없잖습니까. 그런데 그 돈을 형님이 다 통장에 집어넣고 꼭 움켜쥐고'라는 만수 여동생 남편의 말을 통해 확인할 수 있다.")
    thirty_six = input("Please enter the correct answer to question 36: ")
    thirty_six = int(thirty_six)
    if thirty_six == 2:
        thirty_six_score = 2
        print("정답입니다!")
    else:
        thirty_six_score = 0
        print("36번: 2")
        print("'여자들 모두 나를 질투하고 미워하게 되었다.', '내 칫솔에 새똥이 묻어 있기도 하고 면도날이 내가 조리를 담당한 냄비 속에 들어 있기도 했다.'라는 진주의 서술을 통해 구내식당 여직원들의 질투와 괴롭힘을 확인할 수 있다. 또한 이런 상황을 '지옥이 따로 없'다고 느낀 진주가 만수를 찾아 간 것은 진주의 고통이 한계점에 이르렀음을 보여 주는 것이다.")
        print("① 진주가 '이상한 소문'에 '너무한다 싶'어 하면서도 '아예 아무 말을 하지 않'은 것은 상황을 더 학화시킬 것을 우려하여 신중하게 행동한 것이지 주변 상황을 신경 쓰지 않았기 때문이 아니다. ③ '이상한 소문'이 '좀 잠잠해질 때까지' 구내식당 대신 분식집에서 일할 것을 만수가 대안으로 제시하는데, 이 대안의 내용은 진주가 바라고 있었던 것이 아니다. ④ '가난하지만 소박하게, 보통 사람 나름의 행복을 누리면서' 살고 싶다는 삶의 방식을 가진 만수에 대해 빈정거리는 것이 아니라, 기사 식당 운영을 둘러싼 갈등을 우선 해결하여 자신의 '살길'을 찾고자 하는 현실적인 태도를 보여 준다. ⑤ '어처구니없다'는 '일이 너무 뜻밖이어서 기가 막히다'라는 의미이다. 만수 여동생의 남편은 경제적인 어려움 때문에 가족들이고생하는데도 만수가 기사 식당에서 번 돈을 가족들이 아닌 '공장에서 같이 투쟁'하는 사람들을 위해 '엉뚱한 데'사용했다는 것을 기가 막혀 하는 것이지 공장에서 투쟁하는 사람들에 대해 안타까움을 느끼고 있는 것은 아니다.")
    thirty_seven = input("Please enter the correct answer to question 37: ")
    thirty_seven = int(thirty_seven)
    if thirty_seven == 5:
        thirty_seven_score = 2
        print("정답입니다!")
    else:
        thirty_seven_score = 0
        print("37번: 5")
        print("ⓑ에서는 진주에게 주방을 맡기라고 말하며 진주에게 선의를 베풀고자 하는 만수의 태도로 인해 만수와 만수 여동생이 갈등하게 된다. ⓒ에서는 진주와 어떤 관계인지, 진주와 앞으로 어쩔 것인지 묻는 질문에 진주를 옹호하는 만수의 태도로 인해 만수 여동생의 남편이 갈등하게 된다.")
    thirty_eight = input("Please enter the correct answer to question 38: ")
    thirty_eight = int(thirty_eight)
    if thirty_eight == 2:
        thirty_eight_score = 3
        print("정답입니다!")
    else:
        thirty_eight_score = 0
        print("38번: 2")
        print("[B]의 '적금 통장'에는 만수가 그동안 자신의 월급을 모은 돈이 담겨 있는데, 만수는 진주와 만수 여동생의 문제를 해결하기 위해 '제대로 된 식당'을 차리라고 적금 통장을 내놓는다. 이는 주인공 만수가 가족과 동료를 위해 자신이 가진 것을 나누며 희생하는 인물임을 보여 주는 것이므로 물질 만능의 한국 사회로부터 주인공이 소외당하고 있는 현실을 보여 주는 것은 아니다.")
    thirty_nine = input("Please enter the correct answer to question 39: ")
    thirty_nine = int(thirty_nine)
    if thirty_nine == 2:
        thirty_nine_score = 2
        print("정답입니다!")
    else:
        thirty_nine_score = 0
        print("39번: 2")
        print("상서는 황제의 명을 받들어 봉래산의 개언초를 얻으러 가는 길이므로, 상서가 가기를 원하는 곳은 '봉래산'이다. 용자는 상서에게 '인간 세상 사람은 마음대로 선계에 들어갈 수 없'다며 원하는 곳까지 혼자 갈 수 없는 이유를 설명해 주었다.")
        print("③ '항아께서 ~ 모셔 오도록 명했으나'에서 장승상이 사향이 숙향을 모함한 사실을 알고 숙향을 찾았음을 알 수 있다. ⑤ 숙향이 '갈대밭'과 '낙양 옥중'에서 겪을 곤욕은 아직 일어나지 않은 미래의 일이며, 선녀는 숙향에게 공손하게 말하고 있기 때문에 질타하는 것이 아니다.")
    forty = input("Please enter the correct answer to question 40: ")
    forty = int(forty)
    if forty == 4:
        forty_score = 2
        print("정답입니다!")
    else:
        forty_score = 0
        print("40번: 4")
        print("용자의 '저 혼자 가면 아무 데도 걸릴 것 없이 쉽게 갈 수 있사오나, 여러 신령들이 지키고 있기 때문에 인간 세상 사람은 마음대로 선계에 들어갈 수 없나이다.'라는 말을 통해 용자는 ㉠, ㉡을 자유롭게 이동할 수 있음을 알 수 있다.")
        print("① 상서가 선계를 지나기 위해서는 용왕의 공문을 보여 주어야 하므로, ㉠은 용왕의 조력을 통해 상서가 통과할 수 있는 공간이다. ② ㉠의 왕인 경성은 용자가 함께 가는 사람이 '태을성'이라고 하자 '즉시 공문에 날인'하고 상서에게 반갑게 인사한다. 태을성은 천상에서 인간 세상에 내려온 존재로, ㉠은 천상계 존재인 태을성을 호의적으로 생각하는 왕이 지키는 공간이다. ③ 용자가 '상제까서 그것을 아시게 되면 용궁에 큰 변이 일어나고'라고 말한 부분을 볼 때 ㉢은 상제의 권위에 의해 영향을 받는 공간이다. ⑤ 상서는 용자와 ㉠을 거쳐 ㉡으로 향하고 있다.")
    forty_one = input("Please enter the correct answer to question 41: ")
    forty_one = int(forty_one)
    if forty_one == 2:
        forty_one_score = 2
        print("정답입니다!")
    else:
        forty_one_score = 0
        print("41번: 2")
        print("[B]에서는 용자가 '상제께서 그것을 아시게 되는 가정적 상황을 제시하여 '용궁에 큰 변이 ~ 일이 생길 것'이라며 상서가 예상하지 못한 결과가 일어날 수 있음을 전달하고 있다.")
    forty_two = input("Please enter the correct answer to question 42: ")
    forty_two = int(forty_two)
    if forty_two == 1:
        forty_two_score = 3
        print("정답입니다!")
    else:
        forty_two_score = 0
        print("42번: 1")
        print("상제가 이선을 인간 세상에 귀양 보낸 것은 천상의 죄업 때문이며, 이것을 입신양명이라는 당대 남성의 이상적 소망이 형상화된 것으로 보는 것이 적절하지 않다.")
        print("④ '똑같은 일로 죄를 지어 인간 세상에 귀양왔다'는 것에서 천상의 좌업이 공통으로 전제되어 있음을 알 수 있으나, 선군을 마지못해 귀양보낸 것과 달리 숙향은 고행을 겪게 한 것에서 천상의 죄업에 대한 책임을 여성에 두고 있음을 알 수 있다.")
    forty_three = input("Please enter the correct answer to question 43: ")
    forty_three = int(forty_three)
    if forty_three == 3:
        forty_three_score = 2
        print("정답입니다!")
    else:
        forty_three_score = 0
        print("43번: 3")
        print("[C]는 추상적 대상인 '계절'을 '꽃'이라는 자연물로 구체화하여 '피어선 지고'라고 표현하고 있다. 그러나 이는 시간의 흐름 또는 계절의 순환을 의미하는 것이며, '광하'라는 공간이 끊임없이 생성되고 소멸되는 순환성을 보인 것은 아니다.")
        print("① '들렸으랴'라는 설의적 표현을 통해 어떤 생명체도 존재하지 않았던 원시성을 지닌 태초 광야의 모습을 강조하고 있다. ② '바다를 연모'하는 대상으로 인격화된 '산맥'이 '차마 이곳을 범하던 못하였'을 것이라고 추측하여 산맥도 범할 수 없었던 광야의 신성성을 부각하고 있다. ④ '마늘쪽 같이 생긴', '한여름을 알몸으로 사는' 등의 시각적 심상을 통해 고향의 모습을 선명하게 표현하고 있다. ⑤ '아지랑이가 피듯', '태양이 타듯', '제비가 날듯', '길을 따라 물이 흐르듯'이라는 비유적 표현을 활용하여 '천연(天然)히' 살아가는, 인위적이지 않은 마을의 모습을 드러내고 있다.")
    forty_four = input("Please enter the correct answer to question 44: ")
    forty_four = int(forty_four)
    if forty_four == 5:
        forty_four_score = 2
        print("정답입니다!")
    else:
        forty_four_score = 0
        print("44번: 5")
        print("㉠은 화자가 '씨'를 뿌린 '가난한 노래'를 '목 놓아' 부를 존재이다. 화자는 '가난한 노래의 씨'가 자라 노래가 불리게 될 미래를 기대하고 있고, ㉠은 '노래'를 부르는 행위를 통해 화자가 지향하는 이상을 실현하는 존재이다. ㉡은 마을 사람들이 '울타리 밖'에도 심는 대싱이다. ㉡을 자신의 공간인 울타리 안뿐 아니라 울타리 밖에도 심는다는 것은 '화초'를 자신의 소유로 한정하지 않고 남과 함께 나누려고 하는 것이다. 따라서 남을 배려하며 인정이 가득한 마을 사람들의 모습을 드러내는 ㉡은 화자가 지향하는 공동체의 모습을 드러내는 대상이다.")
        print("① ㉡을 통해 화자가 자기의 마음을 반성하거나 살피고 있지 않으므로, ㉡은 화자를 성찰하게 하는 대상이 아니다. ② ㉠은 '눈' 내리는 '지금' 광양의 상황을 극복하고 '가난한 노래의 씨'가 자란 노래를 부르는 존재이므로, ㉠은 공간의 황폐함을 심화하는 존재가 아니다. ③ ㉠은 '지금' 광야의 상황을 극복할 수 있는 존재이므로 ㉠을 공간의 변화를 가져오는 존재로 이해하는 것은 적절하나, ㉡은 공동체가 이미 지니고 있는 모습을 보여주고 있으므로 ㉡은 공동체의 인식 전환을 일으키는 대상이 아니다. ④ 화자는 ㉠이 올 미래를 기다리고 있으므로 ㉠은 화자에게 위화감을 느끼게 하는 존재가 아니다.")
    forty_five = input("Please enter the correct answer to question: ")
    forty_five = int(forty_five)
    if forty_five == 1:
        forty_five_score = 3
        print("정답입니다!")
    else:
        forty_five_score = 0
        print("45번: 1")
        print("<보기>에 따르면 ㈎는 화자가 미래 지향성을 보이는 시로 볼 수 있다. 화자는 '초인이 있어' 노래를 '목 놓아' 부를 발전된 미래에 대한 희망을 가지고 있으며, 이를 위해 '씨를 뿌'라는 극복의 자세를 드러내고는 있다. 그러나 '큰 강물이 비로소 길을' 연 것은 광야에서 인간의 문명이 시작된 과거의 상황을 표현한 것이며, 이를 통해 미래를 향한 희망을 확인한다고 보기 어렵다.")
        print("② 화자는 '지금' '눈'이 내리는 현재의 결핍을 인식하였기 때문에 '가난한 노래의 씨'를 뿌려 부정적인 현재 상황을 적극적으로 극복하고자 하고있다. ③ <보기>에 따르면 ㈏는 화자가 과거지향성을 보이는 시로 볼 수 있다. '소녀'와 '소년'은 때 묻지 않은 순수한 인간의 모습이며, '사랑스러운 들길'은 아름다운 자연의 모습이다. 순수한 사람들과 아름다운 자연이 어우러져 있는 고향의 모습을 통해 화자가 고향을 훼손되지 않은 원형으로 여기고 있음을 알 수 있다. ④ '잔광'이 부시고 '별'이 뜨는 등 아름다운 자연이 돋보이는 마을의 모습을 통해 화자가 마을을 긍정적으로 인식하고 있음을 알 수 있다. ⑤ 과거 '고향', '마을'에 대한 화자의 과거 회상을 '있다'라는 현재 시제로 표현 하는 것은 마을의 모습이 존속하기를 소망하는 화자의 심리를 드러낸 것으로 볼 수 있다.")
    total = one_score + two_score + three_score + four_score + five_score + six_score + seven_score + eight_score + nine_score + ten_score + eleven_score + twelve_score + thirteen_score + fourteen_score + fifteen_score + sixteen_score + seventeen_score + eighteen_score + nineteen_score + twenty_score + twenty_one_score + twenty_two_score + twenty_three_score + twenty_four_score + twenty_five_score + twenty_six_score + twenty_seven_score + twenty_eight_score + twenty_nine_score + thirty_score + thirty_one_score + thirty_two_score + thirty_three_score + thirty_four_score + thirty_five_score + thirty_six_score + thirty_seven_score + thirty_eight_score + thirty_nine_score + forty_score + forty_one_score + forty_two_score + forty_three_score + forty_four_score + forty_five_score
    print("총점은 " + str(total) + "점 입니다.")
    total = int(total)
    if total <= 100 and total >= 83:
        print("등급은 1등급입니다.")
    elif total <= 82 and total >= 74:
        print("등급은 2등급입니다.")
    elif total <= 73 and total >= 63:
        print("등급은 3등급입니다.")
    elif total <= 62 and total >= 55:
        print("등급은 4등급입니다.")
    elif total <= 54 and total >= 45:
        print("등급은 5등급입니다.")
    elif total <= 44 and total >= 34:
        print("등급은 6등급입니다.")
    elif total <= 33 and total >= 25:
        print("등급은 7등급입니다.")
    elif total <= 24 and total >= 19:
        print("등급은 8등급입니다.")
    elif total <= 18 and total >= 0:
        print("등급은 9등급입니다.")
    print("고생하셨습니다.")

score()